# Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) этих двух чисел.

from ast import While


x = int(input())
y = int(input())

if x > y:
    Maxi = x

else:
    Maxi = y

While True:
    if Maxi % x and Maxi % y
    print(Maxi)
break